import numpy as np
import pandas as pd

A = np.array([[5,-1,3,1,2], [-2,8,5,-1,1]])
x = np.array([1,2,3,4,5])

print(A.dot(x))

A = np.array([[1,9,8,5], [3,6,3,2], [3,3,3,3], [0,2,5,9], [4,4,1,2]])
B = np.array([[1,-1,0,1,1], [-2,0,2,-1,1]])
print(A.shape, B.shape)
print(B.dot(A))

x = np.array([1,2,1,0,4])
y = np.array([2,1,-1,1,0])
z = np.array([-1,1,-1,0,0])

G = np.array([x,y,z])
G = G.dot(G.T)
print(G)

Count_DF = pd.DataFrame({'Женские стрижки': [10, 2, 12, 4, 6, 10, 22, 7],
                                'Мужские стрижки': [5, 21, 12, 8, 25, 3, 1, 0],
                                'Окрашивания':[12, 3, 0, 18, 27, 2, 4, 31],
                              'Укладка':[15, 25, 30, 14, 25, 17, 25, 31],
                                'Уход':[10, 6, 4, 5, 18, 12, 20, 28]
                                },
                               index=['Аня', 'Борис', 'Вика', 'Галя', 'Дима', 'Егор', 'Женя','Юра'])
Price_DF = pd.DataFrame({'Женские стрижки': [2, 1.8, 2, 1.8, 2.5, 5, 1.1, 4.5],
                                'Мужские стрижки': [1.5, 2.5, 2, 1.2, 3.5, 5, 1, 4],
                                'Окрашивания':[1, 1, 0, 2.8, 2, 3, 1.5, 2.5],
                              'Укладка':[0.8, 1, 0.5, 0.8, 1, 2, 0.5, 1],
                                'Уход':[1, 1, 2, 2, 1.5, 2.5, 1.7, 2]
                                },
                               index=['Аня', 'Борис', 'Вика', 'Галя', 'Дима', 'Егор', 'Женя','Юра'])

print(Count_DF)
print(Price_DF)

C = Count_DF.values
P = Price_DF.values

salon_inc = (P*C)@([0.2, 0.2, 0.3, 0.1, 0.1])
staff_inc = (P*C)@(1 - np.array([0.2, 0.2, 0.3, 0.1, 0.1]))

print(staff_inc)